ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437vx.h
/*!< MUXH10 configuration */
#define GPIO_MUXH_MUXH10_Pos                (8U)
#define GPIO_MUXH_MUXH10_Msk                (0xFU << GPIO_MUXH_MUXH10_Pos)          /*!< 0x00000F00 */
#define GPIO_MUXH_MUXH10                    GPIO_MUXH_MUXH10_Msk                    /*!< MUXH10[3:0] bits (Multiplexed function select for GPIO x, pin 10) */
#define GPIO_MUXH_MUXH10_0                  (0x1U << GPIO_MUXH_MUXH10_Pos)          /*!< 0x00000100 */
#define GPIO_MUXH_MUXH10_1                  (0x2U << GPIO_MUXH_MUXH10_Pos)          /*!< 0x00000200 */
#define GPIO_MUXH_MUXH10_2                  (0x4U << GPIO_MUXH_MUXH10_Pos)          /*!< 0x00000400 */
#define GPIO_MUXH_MUXH10_3                  (0x8U << GPIO_MUXH_MUXH10_Pos)          /*!< 0x00000800 */

/*!< MUXH11 configuration */
#define GPIO_MUXH_MUXH11_Pos                (12U)
#define GPIO_MUXH_MUXH11_Msk                (0xFU << GPIO_MUXH_MUXH11_Pos)          /*!< 0x0000F000 */
#define GPIO_MUXH_MUXH11                    GPIO_MUXH_MUXH11_Msk                    /*!< MUXH11[3:0] bits (Multiplexed function select for GPIO x, pin 11) */
#define GPIO_MUXH_MUXH11_0                  (0x1U << GPIO_MUXH_MUXH11_Pos)          /*!< 0x00001000 */
#define GPIO_MUXH_MUXH11_1                  (0x2U << GPIO_MUXH_MUXH11_Pos)          /*!< 0x00002000 */
#define GPIO_MUXH_MUXH11_2                  (0x4U << GPIO_MUXH_MUXH11_Pos)          /*!< 0x00004000 */
#define GPIO_MUXH_MUXH11_3                  (0x8U << GPIO_MUXH_MUXH11_Pos)          /*!< 0x00008000 */

/*!< MUXH12 configuration */
#define GPIO_MUXH_MUXH12_Pos                (16U)
#define GPIO_MUXH_MUXH12_Msk                (0xFU << GPIO_MUXH_MUXH12_Pos)          /*!< 0x000F0000 */
#define GPIO_MUXH_MUXH12                    GPIO_MUXH_MUXH12_Msk                    /*!< MUXH12[3:0] bits (Multiplexed function select for GPIO x, pin 12) */
#define GPIO_MUXH_MUXH12_0                  (0x1U << GPIO_MUXH_MUXH12_Pos)          /*!< 0x00010000 */
#define GPIO_MUXH_MUXH12_1                  (0x2U << GPIO_MUXH_MUXH12_Pos)          /*!< 0x00020000 */
#define GPIO_MUXH_MUXH12_2                  (0x4U << GPIO_MUXH_MUXH12_Pos)          /*!< 0x00040000 */
#define GPIO_MUXH_MUXH12_3                  (0x8U << GPIO_MUXH_MUXH12_Pos)          /*!< 0x00080000 */

/*!< MUXH13 configuration */
#define GPIO_MUXH_MUXH13_Pos                (20U)
#define GPIO_MUXH_MUXH13_Msk                (0xFU << GPIO_MUXH_MUXH13_Pos)          /*!< 0x00F00000 */
#define GPIO_MUXH_MUXH13                    GPIO_MUXH_MUXH13_Msk                    /*!< MUXH13[3:0] bits (Multiplexed function select for GPIO x, pin 13) */
#define GPIO_MUXH_MUXH13_0                  (0x1U << GPIO_MUXH_MUXH13_Pos)          /*!< 0x00100000 */
#define GPIO_MUXH_MUXH13_1                  (0x2U << GPIO_MUXH_MUXH13_Pos)          /*!< 0x00200000 */
#define GPIO_MUXH_MUXH13_2                  (0x4U << GPIO_MUXH_MUXH13_Pos)          /*!< 0x00400000 */
#define GPIO_MUXH_MUXH13_3                  (0x8U << GPIO_MUXH_MUXH13_Pos)          /*!< 0x00800000 */

/*!< MUXH14 configuration */
#define GPIO_MUXH_MUXH14_Pos                (24U)
#define GPIO_MUXH_MUXH14_Msk                (0xFU << GPIO_MUXH_MUXH14_Pos)          /*!< 0x0F000000 */
#define GPIO_MUXH_MUXH14                    GPIO_MUXH_MUXH14_Msk                    /*!< MUXH14[3:0] bits (Multiplexed function select for GPIO x, pin 14) */
#define GPIO_MUXH_MUXH14_0                  (0x1U << GPIO_MUXH_MUXH14_Pos)          /*!< 0x01000000 */
#define GPIO_MUXH_MUXH14_1                  (0x2U << GPIO_MUXH_MUXH14_Pos)          /*!< 0x02000000 */
#define GPIO_MUXH_MUXH14_2                  (0x4U << GPIO_MUXH_MUXH14_Pos)          /*!< 0x04000000 */
#define GPIO_MUXH_MUXH14_3                  (0x8U << GPIO_MUXH_MUXH14_Pos)          /*!< 0x08000000 */

/*!< MUXH15 configuration */
#define GPIO_MUXH_MUXH15_Pos                (28U)
#define GPIO_MUXH_MUXH15_Msk                (0xFU << GPIO_MUXH_MUXH15_Pos)          /*!< 0xF0000000 */
#define GPIO_MUXH_MUXH15                    GPIO_MUXH_MUXH15_Msk                    /*!< MUXH15[3:0] bits (Multiplexed function select for GPIO x, pin 15) */
#define GPIO_MUXH_MUXH15_0                  (0x1U << GPIO_MUXH_MUXH15_Pos)          /*!< 0x10000000 */
#define GPIO_MUXH_MUXH15_1                  (0x2U << GPIO_MUXH_MUXH15_Pos)          /*!< 0x20000000 */
#define GPIO_MUXH_MUXH15_2                  (0x4U << GPIO_MUXH_MUXH15_Pos)          /*!< 0x40000000 */
#define GPIO_MUXH_MUXH15_3                  (0x8U << GPIO_MUXH_MUXH15_Pos)          /*!< 0x80000000 */

/*******************  Bit definition for GPIO_CLR register  *******************/
#define GPIO_CLR_IOCB0_Pos                  (0U)
#define GPIO_CLR_IOCB0_Msk                  (0x1U << GPIO_CLR_IOCB0_Pos)            /*!< 0x00000001 */
#define GPIO_CLR_IOCB0                      GPIO_CLR_IOCB0_Msk                      /*!< GPIO x clear bit, pin 0 */
#define GPIO_CLR_IOCB1_Pos                  (1U)
#define GPIO_CLR_IOCB1_Msk                  (0x1U << GPIO_CLR_IOCB1_Pos)            /*!< 0x00000002 */
#define GPIO_CLR_IOCB1                      GPIO_CLR_IOCB1_Msk                      /*!< GPIO x clear bit, pin 1 */
#define GPIO_CLR_IOCB2_Pos                  (2U)
#define GPIO_CLR_IOCB2_Msk                  (0x1U << GPIO_CLR_IOCB2_Pos)            /*!< 0x00000004 */
#define GPIO_CLR_IOCB2                      GPIO_CLR_IOCB2_Msk                      /*!< GPIO x clear bit, pin 2 */
#define GPIO_CLR_IOCB3_Pos                  (3U)
#define GPIO_CLR_IOCB3_Msk                  (0x1U << GPIO_CLR_IOCB3_Pos)            /*!< 0x00000008 */
#define GPIO_CLR_IOCB3                      GPIO_CLR_IOCB3_Msk                      /*!< GPIO x clear bit, pin 3 */
#define GPIO_CLR_IOCB4_Pos                  (4U)
#define GPIO_CLR_IOCB4_Msk                  (0x1U << GPIO_CLR_IOCB4_Pos)            /*!< 0x00000010 */
#define GPIO_CLR_IOCB4                      GPIO_CLR_IOCB4_Msk                      /*!< GPIO x clear bit, pin 4 */
#define GPIO_CLR_IOCB5_Pos                  (5U)
#define GPIO_CLR_IOCB5_Msk                  (0x1U << GPIO_CLR_IOCB5_Pos)            /*!< 0x00000020 */
#define GPIO_CLR_IOCB5                      GPIO_CLR_IOCB5_Msk                      /*!< GPIO x clear bit, pin 5 */
#define GPIO_CLR_IOCB6_Pos                  (6U)
#define GPIO_CLR_IOCB6_Msk                  (0x1U << GPIO_CLR_IOCB6_Pos)            /*!< 0x00000040 */
#define GPIO_CLR_IOCB6                      GPIO_CLR_IOCB6_Msk                      /*!< GPIO x clear bit, pin 6 */
#define GPIO_CLR_IOCB7_Pos                  (7U)
#define GPIO_CLR_IOCB7_Msk                  (0x1U << GPIO_CLR_IOCB7_Pos)            /*!< 0x00000080 */
#define GPIO_CLR_IOCB7                      GPIO_CLR_IOCB7_Msk                      /*!< GPIO x clear bit, pin 7 */
#define GPIO_CLR_IOCB8_Pos                  (8U)
#define GPIO_CLR_IOCB8_Msk                  (0x1U << GPIO_CLR_IOCB8_Pos)            /*!< 0x00000100 */
#define GPIO_CLR_IOCB8                      GPIO_CLR_IOCB8_Msk                      /*!< GPIO x clear bit, pin 8 */
#define GPIO_CLR_IOCB9_Pos                  (9U)
#define GPIO_CLR_IOCB9_Msk                  (0x1U << GPIO_CLR_IOCB9_Pos)            /*!< 0x00000200 */
#define GPIO_CLR_IOCB9                      GPIO_CLR_IOCB9_Msk                      /*!< GPIO x clear bit, pin 9 */
#define GPIO_CLR_IOCB10_Pos                 (10U)
#define GPIO_CLR_IOCB10_Msk                 (0x1U << GPIO_CLR_IOCB10_Pos)           /*!< 0x00000400 */
#define GPIO_CLR_IOCB10                     GPIO_CLR_IOCB10_Msk                     /*!< GPIO x clear bit, pin 10 */
#define GPIO_CLR_IOCB11_Pos                 (11U)
#define GPIO_CLR_IOCB11_Msk                 (0x1U << GPIO_CLR_IOCB11_Pos)           /*!< 0x00000800 */
#define GPIO_CLR_IOCB11                     GPIO_CLR_IOCB11_Msk                     /*!< GPIO x clear bit, pin 11 */
#define GPIO_CLR_IOCB12_Pos                 (12U)
#define GPIO_CLR_IOCB12_Msk                 (0x1U << GPIO_CLR_IOCB12_Pos)           /*!< 0x00001000 */
#define GPIO_CLR_IOCB12                     GPIO_CLR_IOCB12_Msk                     /*!< GPIO x clear bit, pin 12 */
#define GPIO_CLR_IOCB13_Pos                 (13U)
#define GPIO_CLR_IOCB13_Msk                 (0x1U << GPIO_CLR_IOCB13_Pos)           /*!< 0x00002000 */
#define GPIO_CLR_IOCB13                     GPIO_CLR_IOCB13_Msk                     /*!< GPIO x clear bit, pin 13 */
#define GPIO_CLR_IOCB14_Pos                 (14U)
#define GPIO_CLR_IOCB14_Msk                 (0x1U << GPIO_CLR_IOCB14_Pos)           /*!< 0x00004000 */
#define GPIO_CLR_IOCB14                     GPIO_CLR_IOCB14_Msk                     /*!< GPIO x clear bit, pin 14 */
#define GPIO_CLR_IOCB15_Pos                 (15U)
#define GPIO_CLR_IOCB15_Msk                 (0x1U << GPIO_CLR_IOCB15_Pos)           /*!< 0x00008000 */
#define GPIO_CLR_IOCB15                     GPIO_CLR_IOCB15_Msk                     /*!< GPIO x clear bit, pin 15 */

/******************  Bit definition for GPIO_HDRV register  *******************/
#define GPIO_HDRV_HDRV0_Pos                 (0U)
#define GPIO_HDRV_HDRV0_Msk                 (0x1U << GPIO_HDRV_HDRV0_Pos)           /*!< 0x00000001 */
#define GPIO_HDRV_HDRV0                     GPIO_HDRV_HDRV0_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 0 */
#define GPIO_HDRV_HDRV1_Pos                 (1U)
#define GPIO_HDRV_HDRV1_Msk                 (0x1U << GPIO_HDRV_HDRV1_Pos)           /*!< 0x00000002 */
#define GPIO_HDRV_HDRV1                     GPIO_HDRV_HDRV1_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 1 */
#define GPIO_HDRV_HDRV2_Pos                 (2U)
#define GPIO_HDRV_HDRV2_Msk                 (0x1U << GPIO_HDRV_HDRV2_Pos)           /*!< 0x00000004 */
#define GPIO_HDRV_HDRV2                     GPIO_HDRV_HDRV2_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 2 */
#define GPIO_HDRV_HDRV3_Pos                 (3U)
#define GPIO_HDRV_HDRV3_Msk                 (0x1U << GPIO_HDRV_HDRV3_Pos)           /*!< 0x00000008 */
#define GPIO_HDRV_HDRV3                     GPIO_HDRV_HDRV3_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 3 */
#define GPIO_HDRV_HDRV4_Pos                 (4U)
#define GPIO_HDRV_HDRV4_Msk                 (0x1U << GPIO_HDRV_HDRV4_Pos)           /*!< 0x00000010 */
#define GPIO_HDRV_HDRV4                     GPIO_HDRV_HDRV4_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 4 */
#define GPIO_HDRV_HDRV5_Pos                 (5U)
#define GPIO_HDRV_HDRV5_Msk                 (0x1U << GPIO_HDRV_HDRV5_Pos)           /*!< 0x00000020 */
#define GPIO_HDRV_HDRV5                     GPIO_HDRV_HDRV5_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 5 */
#define GPIO_HDRV_HDRV6_Pos                 (6U)
#define GPIO_HDRV_HDRV6_Msk                 (0x1U << GPIO_HDRV_HDRV6_Pos)           /*!< 0x00000040 */
#define GPIO_HDRV_HDRV6                     GPIO_HDRV_HDRV6_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 6 */
#define GPIO_HDRV_HDRV7_Pos                 (7U)
#define GPIO_HDRV_HDRV7_Msk                 (0x1U << GPIO_HDRV_HDRV7_Pos)           /*!< 0x00000080 */
#define GPIO_HDRV_HDRV7                     GPIO_HDRV_HDRV7_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 7 */
#define GPIO_HDRV_HDRV8_Pos                 (8U)
#define GPIO_HDRV_HDRV8_Msk                 (0x1U << GPIO_HDRV_HDRV8_Pos)           /*!< 0x00000100 */
#define GPIO_HDRV_HDRV8                     GPIO_HDRV_HDRV8_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 8 */
#define GPIO_HDRV_HDRV9_Pos                 (9U)
#define GPIO_HDRV_HDRV9_Msk                 (0x1U << GPIO_HDRV_HDRV9_Pos)           /*!< 0x00000200 */
#define GPIO_HDRV_HDRV9                     GPIO_HDRV_HDRV9_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 9 */
#define GPIO_HDRV_HDRV10_Pos                (10U)
#define GPIO_HDRV_HDRV10_Msk                (0x1U << GPIO_HDRV_HDRV10_Pos)          /*!< 0x00000400 */
#define GPIO_HDRV_HDRV10                    GPIO_HDRV_HDRV10_Msk                    /*!< GPIO x huge sourcing/sinking strength control, pin 10 */
#define GPIO_HDRV_HDRV11_Pos                (11U)
#define GPIO_HDRV_HDRV11_Msk                (0x1U << GPIO_HDRV_HDRV11_Pos)          /*!< 0x00000800 */
#define GPIO_HDRV_HDRV11                    GPIO_HDRV_HDRV11_Msk                    /*!< GPIO x huge sourcing/sinking strength control, pin 11 */
#define GPIO_HDRV_HDRV12_Pos                (12U)
#define GPIO_HDRV_HDRV12_Msk                (0x1U << GPIO_HDRV_HDRV12_Pos)          /*!< 0x00001000 */
#define GPIO_HDRV_HDRV12                    GPIO_HDRV_HDRV12_Msk                    /*!< GPIO x huge sourcing/sinking strength control, pin 12 */
#define GPIO_HDRV_HDRV13_Pos                (13U)
#define GPIO_HDRV_HDRV13_Msk                (0x1U << GPIO_HDRV_HDRV13_Pos)          /*!< 0x00002000 */
#define GPIO_HDRV_HDRV13                    GPIO_HDRV_HDRV13_Msk                    /*!< GPIO x huge sourcing/sinking strength control, pin 13 */
#define GPIO_HDRV_HDRV14_Pos                (14U)
#define GPIO_HDRV_HDRV14_Msk                (0x1U << GPIO_HDRV_HDRV14_Pos)          /*!< 0x00004000 */
#define GPIO_HDRV_HDRV14                    GPIO_HDRV_HDRV14_Msk                    /*!< GPIO x huge sourcing/sinking strength control, pin 14 */
#define GPIO_HDRV_HDRV15_Pos                (15U)
#define GPIO_HDRV_HDRV15_Msk                (0x1U << GPIO_HDRV_HDRV15_Pos)          /*!< 0x00008000 */
#define GPIO_HDRV_HDRV15                    GPIO_HDRV_HDRV15_Msk                    /*!< GPIO x huge sourcing/sinking strength control, pin 15 */

/******************************************************************************/
/*                                                                            */
/*                   System configuration controller (SCFG)                   */
/*                                                                            */
/******************************************************************************/
/*!< MEM_MAP_SEL configuration */
#define SCFG_CFG1_MEM_MAP_SEL_Pos           (0U)
#define SCFG_CFG1_MEM_MAP_SEL_Msk           (0x7U << SCFG_CFG1_MEM_MAP_SEL_Pos)     /*!< 0x00000007 */
#define SCFG_CFG1_MEM_MAP_SEL               SCFG_CFG1_MEM_MAP_SEL_Msk               /*!< MEM_MAP_SEL[3:0] bits (Boot mode status bit) */
#define SCFG_CFG1_MEM_MAP_SEL_0             (0x1U << SCFG_CFG1_MEM_MAP_SEL_Pos)     /*!< 0x00000001 */
#define SCFG_CFG1_MEM_MAP_SEL_1             (0x2U << SCFG_CFG1_MEM_MAP_SEL_Pos)     /*!< 0x00000002 */
#define SCFG_CFG1_MEM_MAP_SEL_2             (0x4U << SCFG_CFG1_MEM_MAP_SEL_Pos)     /*!< 0x00000002 */

#define SCFG_CFG1_MEM_MAP_SEL_FLASHMEM      0x00000000U                             /*!< Boot from main flash memory */
#define SCFG_CFG1_MEM_MAP_SEL_SYSMEM        0x00000001U                             /*!< Boot from system memory */
#define SCFG_CFG1_MEM_MAP_SEL_XMC_BANK1     0x00000002U                             /*!< Boot from XMC BANK1 */
#define SCFG_CFG1_MEM_MAP_SEL_INTSRAM       0x00000003U                             /*!< Boot from internal SRAM */
#define SCFG_CFG1_MEM_MAP_SEL_XMC_SDRAM     0x00000004U                             /*!< Boot from XMC SDRAM */

#define SCFG_CFG1_IR_POL_Pos                (5U)
#define SCFG_CFG1_IR_POL_Msk                (0x1U << SCFG_CFG1_IR_POL_Pos)          /*!< 0x00000020 */
#define SCFG_CFG1_IR_POL                    SCFG_CFG1_IR_POL_Msk                    /*!< Infrared output polarity selection */

/*!< IR_SRC_SEL configuration */
#define SCFG_CFG1_IR_SRC_SEL_Pos            (6U)
#define SCFG_CFG1_IR_SRC_SEL_Msk            (0x3U << SCFG_CFG1_IR_SRC_SEL_Pos)      /*!< 0x000000C0 */
#define SCFG_CFG1_IR_SRC_SEL                SCFG_CFG1_IR_SRC_SEL_Msk                /*!< IR_SRC_SEL[1:0] bits (IR modulation envelope signal source selection) */
#define SCFG_CFG1_IR_SRC_SEL_0              (0x1U << SCFG_CFG1_IR_SRC_SEL_Pos)      /*!< 0x00000040 */
#define SCFG_CFG1_IR_SRC_SEL_1              (0x2U << SCFG_CFG1_IR_SRC_SEL_Pos)      /*!< 0x00000080 */

#define SCFG_CFG1_IR_SRC_SEL_TMR10          0x00000000U                             /*!< TMR10 */

/*!< SWAP_XMC configuration */
#define SCFG_CFG1_SWAP_XMC_Pos              (10U)
#define SCFG_CFG1_SWAP_XMC_Msk              (0x3U << SCFG_CFG1_SWAP_XMC_Pos)        /*!< 0x00000C00 */
#define SCFG_CFG1_SWAP_XMC                  SCFG_CFG1_SWAP_XMC_Msk                  /*!< SWAP_XMC[1:0] bits (swap xmc source selection) */
#define SCFG_CFG1_SWAP_XMC_0                (0x1U << SCFG_CFG1_SWAP_XMC_Pos)        /*!< 0x00000400 */
#define SCFG_CFG1_SWAP_XMC_1                (0x2U << SCFG_CFG1_SWAP_XMC_Pos)        /*!< 0x00000800 */

