ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437vx.h
/****************  Bit definition for DMA_MUXSYNCSTS register  ****************/
#define DMA_MUXSYNCSTS_SYNCOVF_Pos          (0U)
#define DMA_MUXSYNCSTS_SYNCOVF_Msk          (0xFFU << DMA_MUXSYNCSTS_SYNCOVF_Pos)   /*!< 0x000000FF */
#define DMA_MUXSYNCSTS_SYNCOVF              DMA_MUXSYNCSTS_SYNCOVF_Msk              /*!< Synchronization overrun interrupt flag */

/****************  Bit definition for DMA_MUXSYNCCLR register  ****************/
#define DMA_MUXSYNCCLR_SYNCOVFC_Pos         (0U)
#define DMA_MUXSYNCCLR_SYNCOVFC_Msk         (0xFFU << DMA_MUXSYNCCLR_SYNCOVFC_Pos)  /*!< 0x000000FF */
#define DMA_MUXSYNCCLR_SYNCOVFC             DMA_MUXSYNCCLR_SYNCOVFC_Msk             /*!< Synchronization overrun interrupt flag clear */

/*****************  Bit definition for DMA_MUXGSTS register  ******************/
#define DMA_MUXGSTS_TRGOVF_Pos              (0U)
#define DMA_MUXGSTS_TRGOVF_Msk              (0xFU << DMA_MUXGSTS_TRGOVF_Pos)        /*!< 0x0000000F */
#define DMA_MUXGSTS_TRGOVF                  DMA_MUXGSTS_TRGOVF_Msk                  /*!< Trigger overrun interrupt flag */

/*****************  Bit definition for DMA_MUXGCLR register  ******************/
#define DMA_MUXGCLR_TRGOVFC_Pos             (0U)
#define DMA_MUXGCLR_TRGOVFC_Msk             (0xFU << DMA_MUXGCLR_TRGOVFC_Pos)       /*!< 0x0000000F */
#define DMA_MUXGCLR_TRGOVFC                 DMA_MUXGCLR_TRGOVFC_Msk                 /*!< Trigger overrun interrupt flag clear */

/******************************************************************************/
/*                                                                            */
/*                  Inter-integrated circuit interface (I2C)                  */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for I2C_CTRL1 register  *******************/
#define I2C_CTRL1_I2CEN_Pos                 (0U)
#define I2C_CTRL1_I2CEN_Msk                 (0x1U << I2C_CTRL1_I2CEN_Pos)           /*!< 0x00000001 */
#define I2C_CTRL1_I2CEN                     I2C_CTRL1_I2CEN_Msk                     /*!< I2C peripheral enable */
#define I2C_CTRL1_TDIEN_Pos                 (1U)
#define I2C_CTRL1_TDIEN_Msk                 (0x1U << I2C_CTRL1_TDIEN_Pos)           /*!< 0x00000002 */
#define I2C_CTRL1_TDIEN                     I2C_CTRL1_TDIEN_Msk                     /*!< Data transmit data interrupt enable */
#define I2C_CTRL1_RDIEN_Pos                 (2U)
#define I2C_CTRL1_RDIEN_Msk                 (0x1U << I2C_CTRL1_RDIEN_Pos)           /*!< 0x00000004 */
#define I2C_CTRL1_RDIEN                     I2C_CTRL1_RDIEN_Msk                     /*!< Data receive interrupt enable */
#define I2C_CTRL1_ADDRIEN_Pos               (3U)
#define I2C_CTRL1_ADDRIEN_Msk               (0x1U << I2C_CTRL1_ADDRIEN_Pos)         /*!< 0x00000008 */
#define I2C_CTRL1_ADDRIEN                   I2C_CTRL1_ADDRIEN_Msk                   /*!< Address match interrupt enable */
#define I2C_CTRL1_ACKFAILIEN_Pos            (4U)
#define I2C_CTRL1_ACKFAILIEN_Msk            (0x1U << I2C_CTRL1_ACKFAILIEN_Pos)      /*!< 0x00000010 */
#define I2C_CTRL1_ACKFAILIEN                I2C_CTRL1_ACKFAILIEN_Msk                /*!< Acknowledge fail interrupt enable */
#define I2C_CTRL1_STOPIEN_Pos               (5U)
#define I2C_CTRL1_STOPIEN_Msk               (0x1U << I2C_CTRL1_STOPIEN_Pos)         /*!< 0x00000020 */
#define I2C_CTRL1_STOPIEN                   I2C_CTRL1_STOPIEN_Msk                   /*!< Stop generation complete interrupt enable */
#define I2C_CTRL1_TDCIEN_Pos                (6U)
#define I2C_CTRL1_TDCIEN_Msk                (0x1U << I2C_CTRL1_TDCIEN_Pos)          /*!< 0x00000040 */
#define I2C_CTRL1_TDCIEN                    I2C_CTRL1_TDCIEN_Msk                    /*!< Data transfer complete interrupt enable */
#define I2C_CTRL1_ERRIEN_Pos                (7U)
#define I2C_CTRL1_ERRIEN_Msk                (0x1U << I2C_CTRL1_ERRIEN_Pos)          /*!< 0x00000080 */
#define I2C_CTRL1_ERRIEN                    I2C_CTRL1_ERRIEN_Msk                    /*!< Error interrupt enable */
#define I2C_CTRL1_DFLT_Pos                  (8U)
#define I2C_CTRL1_DFLT_Msk                  (0xFU << I2C_CTRL1_DFLT_Pos)            /*!< 0x00000F00 */
#define I2C_CTRL1_DFLT                      I2C_CTRL1_DFLT_Msk                      /*!< Digital filter value */
#define I2C_CTRL1_DMATEN_Pos                (14U)
#define I2C_CTRL1_DMATEN_Msk                (0x1U << I2C_CTRL1_DMATEN_Pos)          /*!< 0x00004000 */
#define I2C_CTRL1_DMATEN                    I2C_CTRL1_DMATEN_Msk                    /*!< DMA transmit data request enable */
#define I2C_CTRL1_DMAREN_Pos                (15U)
#define I2C_CTRL1_DMAREN_Msk                (0x1U << I2C_CTRL1_DMAREN_Pos)          /*!< 0x00008000 */
#define I2C_CTRL1_DMAREN                    I2C_CTRL1_DMAREN_Msk                    /*!< DMA receive data request enable */
#define I2C_CTRL1_SCTRL_Pos                 (16U)
#define I2C_CTRL1_SCTRL_Msk                 (0x1U << I2C_CTRL1_SCTRL_Pos)           /*!< 0x00010000 */
#define I2C_CTRL1_SCTRL                     I2C_CTRL1_SCTRL_Msk                     /*!< Slave receiving data control */
#define I2C_CTRL1_STRETCH_Pos               (17U)
#define I2C_CTRL1_STRETCH_Msk               (0x1U << I2C_CTRL1_STRETCH_Pos)         /*!< 0x00020000 */
#define I2C_CTRL1_STRETCH                   I2C_CTRL1_STRETCH_Msk                   /*!< Clock stretching mode */
#define I2C_CTRL1_GCAEN_Pos                 (19U)
#define I2C_CTRL1_GCAEN_Msk                 (0x1U << I2C_CTRL1_GCAEN_Pos)           /*!< 0x00080000 */
#define I2C_CTRL1_GCAEN                     I2C_CTRL1_GCAEN_Msk                     /*!< General call address enable */
#define I2C_CTRL1_HADDREN_Pos               (20U)
#define I2C_CTRL1_HADDREN_Msk               (0x1U << I2C_CTRL1_HADDREN_Pos)         /*!< 0x00100000 */
#define I2C_CTRL1_HADDREN                   I2C_CTRL1_HADDREN_Msk                   /*!< SMBus host address enable */
#define I2C_CTRL1_DEVADDREN_Pos             (21U)
#define I2C_CTRL1_DEVADDREN_Msk             (0x1U << I2C_CTRL1_DEVADDREN_Pos)       /*!< 0x00200000 */
#define I2C_CTRL1_DEVADDREN                 I2C_CTRL1_DEVADDREN_Msk                 /*!< SMBus device default address enable */
#define I2C_CTRL1_SMBALERT_Pos              (22U)
#define I2C_CTRL1_SMBALERT_Msk              (0x1U << I2C_CTRL1_SMBALERT_Pos)        /*!< 0x00400000 */
#define I2C_CTRL1_SMBALERT                  I2C_CTRL1_SMBALERT_Msk                  /*!< SMBus alert enable / pin set */
#define I2C_CTRL1_PECEN_Pos                 (23U)
#define I2C_CTRL1_PECEN_Msk                 (0x1U << I2C_CTRL1_PECEN_Pos)           /*!< 0x00800000 */
#define I2C_CTRL1_PECEN                     I2C_CTRL1_PECEN_Msk                     /*!< PEC calculation enable */

/******************  Bit definition for I2C_CTRL2 register  *******************/
/*!< SADDR configuration */
#define I2C_CTRL2_SADDR_Pos                 (0U)
#define I2C_CTRL2_SADDR_Msk                 (0x3FFU << I2C_CTRL2_SADDR_Pos)         /*!< 0x000003FF */
#define I2C_CTRL2_SADDR                     I2C_CTRL2_SADDR_Msk                     /*!< SADDR[9:0] bits (Slave address sent by the master) */
#define I2C_CTRL2_SADDR_0                   (0x001U << I2C_CTRL2_SADDR_Pos)         /*!< 0x00000001 */
#define I2C_CTRL2_SADDR_1                   (0x002U << I2C_CTRL2_SADDR_Pos)         /*!< 0x00000002 */
#define I2C_CTRL2_SADDR_2                   (0x004U << I2C_CTRL2_SADDR_Pos)         /*!< 0x00000004 */
#define I2C_CTRL2_SADDR_3                   (0x008U << I2C_CTRL2_SADDR_Pos)         /*!< 0x00000008 */
#define I2C_CTRL2_SADDR_4                   (0x010U << I2C_CTRL2_SADDR_Pos)         /*!< 0x00000010 */
#define I2C_CTRL2_SADDR_5                   (0x020U << I2C_CTRL2_SADDR_Pos)         /*!< 0x00000020 */
#define I2C_CTRL2_SADDR_6                   (0x040U << I2C_CTRL2_SADDR_Pos)         /*!< 0x00000040 */
#define I2C_CTRL2_SADDR_7                   (0x080U << I2C_CTRL2_SADDR_Pos)         /*!< 0x00000080 */
#define I2C_CTRL2_SADDR_8                   (0x100U << I2C_CTRL2_SADDR_Pos)         /*!< 0x00000100 */
#define I2C_CTRL2_SADDR_9                   (0x200U << I2C_CTRL2_SADDR_Pos)         /*!< 0x00000200 */

#define I2C_CTRL2_DIR_Pos                   (10U)
#define I2C_CTRL2_DIR_Msk                   (0x1U << I2C_CTRL2_DIR_Pos)             /*!< 0x00000400 */
#define I2C_CTRL2_DIR                       I2C_CTRL2_DIR_Msk                       /*!< Master data transmission direction */
#define I2C_CTRL2_ADDR10_Pos                (11U)
#define I2C_CTRL2_ADDR10_Msk                (0x1U << I2C_CTRL2_ADDR10_Pos)          /*!< 0x00000800 */
#define I2C_CTRL2_ADDR10                    I2C_CTRL2_ADDR10_Msk                    /*!< Host sends 10-bit address mode enable */
#define I2C_CTRL2_READH10_Pos               (12U)
#define I2C_CTRL2_READH10_Msk               (0x1U << I2C_CTRL2_READH10_Pos)         /*!< 0x00001000 */
#define I2C_CTRL2_READH10                   I2C_CTRL2_READH10_Msk                   /*!< 10-bit address header read enable */
#define I2C_CTRL2_GENSTART_Pos              (13U)
#define I2C_CTRL2_GENSTART_Msk              (0x1U << I2C_CTRL2_GENSTART_Pos)        /*!< 0x00002000 */
#define I2C_CTRL2_GENSTART                  I2C_CTRL2_GENSTART_Msk                  /*!< Generate start condition */
#define I2C_CTRL2_GENSTOP_Pos               (14U)
#define I2C_CTRL2_GENSTOP_Msk               (0x1U << I2C_CTRL2_GENSTOP_Pos)         /*!< 0x00004000 */
#define I2C_CTRL2_GENSTOP                   I2C_CTRL2_GENSTOP_Msk                   /*!< Generate stop condition */
#define I2C_CTRL2_NACKEN_Pos                (15U)
#define I2C_CTRL2_NACKEN_Msk                (0x1U << I2C_CTRL2_NACKEN_Pos)          /*!< 0x00008000 */
#define I2C_CTRL2_NACKEN                    I2C_CTRL2_NACKEN_Msk                    /*!< Not acknowledge enable */

/*!< CNT configuration */
#define I2C_CTRL2_CNT_Pos                   (16U)
#define I2C_CTRL2_CNT_Msk                   (0xFFU << I2C_CTRL2_CNT_Pos)            /*!< 0x00FF0000 */
#define I2C_CTRL2_CNT                       I2C_CTRL2_CNT_Msk                       /*!< CNT[7:0] bits (CNT) */
#define I2C_CTRL2_CNT_0                     (0x01U << I2C_CTRL2_CNT_Pos)            /*!< 0x00010000 */
#define I2C_CTRL2_CNT_1                     (0x02U << I2C_CTRL2_CNT_Pos)            /*!< 0x00020000 */
#define I2C_CTRL2_CNT_2                     (0x04U << I2C_CTRL2_CNT_Pos)            /*!< 0x00040000 */
#define I2C_CTRL2_CNT_3                     (0x08U << I2C_CTRL2_CNT_Pos)            /*!< 0x00080000 */
#define I2C_CTRL2_CNT_4                     (0x10U << I2C_CTRL2_CNT_Pos)            /*!< 0x00100000 */
#define I2C_CTRL2_CNT_5                     (0x20U << I2C_CTRL2_CNT_Pos)            /*!< 0x00200000 */
#define I2C_CTRL2_CNT_6                     (0x40U << I2C_CTRL2_CNT_Pos)            /*!< 0x00400000 */
#define I2C_CTRL2_CNT_7                     (0x80U << I2C_CTRL2_CNT_Pos)            /*!< 0x00800000 */

#define I2C_CTRL2_RLDEN_Pos                 (24U)
#define I2C_CTRL2_RLDEN_Msk                 (0x1U << I2C_CTRL2_RLDEN_Pos)           /*!< 0x01000000 */
#define I2C_CTRL2_RLDEN                     I2C_CTRL2_RLDEN_Msk                     /*!< Send data reload mode enable */
#define I2C_CTRL2_ASTOPEN_Pos               (25U)
#define I2C_CTRL2_ASTOPEN_Msk               (0x1U << I2C_CTRL2_ASTOPEN_Pos)         /*!< 0x02000000 */
#define I2C_CTRL2_ASTOPEN                   I2C_CTRL2_ASTOPEN_Msk                   /*!< Automatically send stop condition enable */
#define I2C_CTRL2_PECTEN_Pos                (26U)
#define I2C_CTRL2_PECTEN_Msk                (0x1U << I2C_CTRL2_PECTEN_Pos)          /*!< 0x04000000 */
#define I2C_CTRL2_PECTEN                    I2C_CTRL2_PECTEN_Msk                    /*!< Request PEC transmission enable */

/******************  Bit definition for I2C_OADDR1 register  ******************/
/*!< ADDR1 configuration */
#define I2C_OADDR1_ADDR1_1_7                0x000000FEU                             /*!< Interface Address */
#define I2C_OADDR1_ADDR1_8_9                0x00000300U                             /*!< Interface Address */

