ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437vx.h
/*!< CSPT17 configuration */
#define ADC_SPT1_CSPT17_Pos                 (21U)
#define ADC_SPT1_CSPT17_Msk                 (0x7U << ADC_SPT1_CSPT17_Pos)           /*!< 0x00E00000 */
#define ADC_SPT1_CSPT17                     ADC_SPT1_CSPT17_Msk                     /*!< CSPT17[2:0] bits (Sample time selection of channel ADC_IN17) */
#define ADC_SPT1_CSPT17_0                   (0x1U << ADC_SPT1_CSPT17_Pos)           /*!< 0x00200000 */
#define ADC_SPT1_CSPT17_1                   (0x2U << ADC_SPT1_CSPT17_Pos)           /*!< 0x00400000 */
#define ADC_SPT1_CSPT17_2                   (0x4U << ADC_SPT1_CSPT17_Pos)           /*!< 0x00800000 */

/*!< CSPT18 configuration */
#define ADC_SPT1_CSPT18_Pos                 (24U)
#define ADC_SPT1_CSPT18_Msk                 (0x7U << ADC_SPT1_CSPT18_Pos)           /*!< 0x07000000 */
#define ADC_SPT1_CSPT18                     ADC_SPT1_CSPT18_Msk                     /*!< CSPT18[2:0] bits (Sample time selection of channel ADC_IN18) */
#define ADC_SPT1_CSPT18_0                   (0x1U << ADC_SPT1_CSPT18_Pos)           /*!< 0x01000000 */
#define ADC_SPT1_CSPT18_1                   (0x2U << ADC_SPT1_CSPT18_Pos)           /*!< 0x02000000 */
#define ADC_SPT1_CSPT18_2                   (0x4U << ADC_SPT1_CSPT18_Pos)           /*!< 0x04000000 */

/*******************  Bit definition for ADC_SPT2 register  *******************/
/*!< CSPT0 configuration */
#define ADC_SPT2_CSPT0_Pos                  (0U)
#define ADC_SPT2_CSPT0_Msk                  (0x7U << ADC_SPT2_CSPT0_Pos)            /*!< 0x00000007 */
#define ADC_SPT2_CSPT0                      ADC_SPT2_CSPT0_Msk                      /*!< CSPT0[2:0] bits (Sample time selection of channel ADC_IN0) */
#define ADC_SPT2_CSPT0_0                    (0x1U << ADC_SPT2_CSPT0_Pos)            /*!< 0x00000001 */
#define ADC_SPT2_CSPT0_1                    (0x2U << ADC_SPT2_CSPT0_Pos)            /*!< 0x00000002 */
#define ADC_SPT2_CSPT0_2                    (0x4U << ADC_SPT2_CSPT0_Pos)            /*!< 0x00000004 */

/*!< CSPT1 configuration */
#define ADC_SPT2_CSPT1_Pos                  (3U)
#define ADC_SPT2_CSPT1_Msk                  (0x7U << ADC_SPT2_CSPT1_Pos)            /*!< 0x00000038 */
#define ADC_SPT2_CSPT1                      ADC_SPT2_CSPT1_Msk                      /*!< CSPT1[2:0] bits (Sample time selection of channel ADC_IN1) */
#define ADC_SPT2_CSPT1_0                    (0x1U << ADC_SPT2_CSPT1_Pos)            /*!< 0x00000008 */
#define ADC_SPT2_CSPT1_1                    (0x2U << ADC_SPT2_CSPT1_Pos)            /*!< 0x00000010 */
#define ADC_SPT2_CSPT1_2                    (0x4U << ADC_SPT2_CSPT1_Pos)            /*!< 0x00000020 */

/*!< CSPT2 configuration */
#define ADC_SPT2_CSPT2_Pos                  (6U)
#define ADC_SPT2_CSPT2_Msk                  (0x7U << ADC_SPT2_CSPT2_Pos)            /*!< 0x000001C0 */
#define ADC_SPT2_CSPT2                      ADC_SPT2_CSPT2_Msk                      /*!< CSPT2[2:0] bits (Sample time selection of channel ADC_IN2) */
#define ADC_SPT2_CSPT2_0                    (0x1U << ADC_SPT2_CSPT2_Pos)            /*!< 0x00000040 */
#define ADC_SPT2_CSPT2_1                    (0x2U << ADC_SPT2_CSPT2_Pos)            /*!< 0x00000080 */
#define ADC_SPT2_CSPT2_2                    (0x4U << ADC_SPT2_CSPT2_Pos)            /*!< 0x00000100 */

/*!< CSPT3 configuration */
#define ADC_SPT2_CSPT3_Pos                  (9U)
#define ADC_SPT2_CSPT3_Msk                  (0x7U << ADC_SPT2_CSPT3_Pos)            /*!< 0x00000E00 */
#define ADC_SPT2_CSPT3                      ADC_SPT2_CSPT3_Msk                      /*!< CSPT3[2:0] bits (Sample time selection of channel ADC_IN3) */
#define ADC_SPT2_CSPT3_0                    (0x1U << ADC_SPT2_CSPT3_Pos)            /*!< 0x00000200 */
#define ADC_SPT2_CSPT3_1                    (0x2U << ADC_SPT2_CSPT3_Pos)            /*!< 0x00000400 */
#define ADC_SPT2_CSPT3_2                    (0x4U << ADC_SPT2_CSPT3_Pos)            /*!< 0x00000800 */

/*!< CSPT4 configuration */
#define ADC_SPT2_CSPT4_Pos                  (12U)
#define ADC_SPT2_CSPT4_Msk                  (0x7U << ADC_SPT2_CSPT4_Pos)            /*!< 0x00007000 */
#define ADC_SPT2_CSPT4                      ADC_SPT2_CSPT4_Msk                      /*!< CSPT4[2:0] bits (Sample time selection of channel ADC_IN4) */
#define ADC_SPT2_CSPT4_0                    (0x1U << ADC_SPT2_CSPT4_Pos)            /*!< 0x00001000 */
#define ADC_SPT2_CSPT4_1                    (0x2U << ADC_SPT2_CSPT4_Pos)            /*!< 0x00002000 */
#define ADC_SPT2_CSPT4_2                    (0x4U << ADC_SPT2_CSPT4_Pos)            /*!< 0x00004000 */

/*!< CSPT5 configuration */
#define ADC_SPT2_CSPT5_Pos                  (15U)
#define ADC_SPT2_CSPT5_Msk                  (0x7U << ADC_SPT2_CSPT5_Pos)            /*!< 0x00038000 */
#define ADC_SPT2_CSPT5                      ADC_SPT2_CSPT5_Msk                      /*!< CSPT5[2:0] bits (Sample time selection of channel ADC_IN5) */
#define ADC_SPT2_CSPT5_0                    (0x1U << ADC_SPT2_CSPT5_Pos)            /*!< 0x00008000 */
#define ADC_SPT2_CSPT5_1                    (0x2U << ADC_SPT2_CSPT5_Pos)            /*!< 0x00010000 */
#define ADC_SPT2_CSPT5_2                    (0x4U << ADC_SPT2_CSPT5_Pos)            /*!< 0x00020000 */

/*!< CSPT6 configuration */
#define ADC_SPT2_CSPT6_Pos                  (18U)
#define ADC_SPT2_CSPT6_Msk                  (0x7U << ADC_SPT2_CSPT6_Pos)            /*!< 0x001C0000 */
#define ADC_SPT2_CSPT6                      ADC_SPT2_CSPT6_Msk                      /*!< CSPT6[2:0] bits (Sample time selection of channel ADC_IN6) */
#define ADC_SPT2_CSPT6_0                    (0x1U << ADC_SPT2_CSPT6_Pos)            /*!< 0x00040000 */
#define ADC_SPT2_CSPT6_1                    (0x2U << ADC_SPT2_CSPT6_Pos)            /*!< 0x00080000 */
#define ADC_SPT2_CSPT6_2                    (0x4U << ADC_SPT2_CSPT6_Pos)            /*!< 0x00100000 */

/*!< CSPT7 configuration */
#define ADC_SPT2_CSPT7_Pos                  (21U)
#define ADC_SPT2_CSPT7_Msk                  (0x7U << ADC_SPT2_CSPT7_Pos)            /*!< 0x00E00000 */
#define ADC_SPT2_CSPT7                      ADC_SPT2_CSPT7_Msk                      /*!< CSPT7[2:0] bits (Sample time selection of channel ADC_IN7) */
#define ADC_SPT2_CSPT7_0                    (0x1U << ADC_SPT2_CSPT7_Pos)            /*!< 0x00200000 */
#define ADC_SPT2_CSPT7_1                    (0x2U << ADC_SPT2_CSPT7_Pos)            /*!< 0x00400000 */
#define ADC_SPT2_CSPT7_2                    (0x4U << ADC_SPT2_CSPT7_Pos)            /*!< 0x00800000 */

/*!< CSPT8 configuration */
#define ADC_SPT2_CSPT8_Pos                  (24U)
#define ADC_SPT2_CSPT8_Msk                  (0x7U << ADC_SPT2_CSPT8_Pos)            /*!< 0x07000000 */
#define ADC_SPT2_CSPT8                      ADC_SPT2_CSPT8_Msk                      /*!< CSPT8[2:0] bits (Sample time selection of channel ADC_IN8) */
#define ADC_SPT2_CSPT8_0                    (0x1U << ADC_SPT2_CSPT8_Pos)            /*!< 0x01000000 */
#define ADC_SPT2_CSPT8_1                    (0x2U << ADC_SPT2_CSPT8_Pos)            /*!< 0x02000000 */
#define ADC_SPT2_CSPT8_2                    (0x4U << ADC_SPT2_CSPT8_Pos)            /*!< 0x04000000 */

