ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437vx.h
/*!< CSPT9 configuration */
#define ADC_SPT2_CSPT9_Pos                  (27U)
#define ADC_SPT2_CSPT9_Msk                  (0x7U << ADC_SPT2_CSPT9_Pos)            /*!< 0x38000000 */
#define ADC_SPT2_CSPT9                      ADC_SPT2_CSPT9_Msk                      /*!< CSPT9[2:0] bits (Sample time selection of channel ADC_IN9) */
#define ADC_SPT2_CSPT9_0                    (0x1U << ADC_SPT2_CSPT9_Pos)            /*!< 0x08000000 */
#define ADC_SPT2_CSPT9_1                    (0x2U << ADC_SPT2_CSPT9_Pos)            /*!< 0x10000000 */
#define ADC_SPT2_CSPT9_2                    (0x4U << ADC_SPT2_CSPT9_Pos)            /*!< 0x20000000 */

/******************  Bit definition for ADC_PCDTO1 register  ******************/
#define ADC_PCDTO1_PCDTO1_Pos               (0U)
#define ADC_PCDTO1_PCDTO1_Msk               (0xFFFU << ADC_PCDTO1_PCDTO1_Pos)       /*!< 0x00000FFF */
#define ADC_PCDTO1_PCDTO1                   ADC_PCDTO1_PCDTO1_Msk                   /*!< Data offset for Preempted channel 1 */

/******************  Bit definition for ADC_PCDTO2 register  ******************/
#define ADC_PCDTO2_PCDTO2_Pos               (0U)
#define ADC_PCDTO2_PCDTO2_Msk               (0xFFFU << ADC_PCDTO2_PCDTO2_Pos)       /*!< 0x00000FFF */
#define ADC_PCDTO2_PCDTO2                   ADC_PCDTO2_PCDTO2_Msk                   /*!< Data offset for Preempted channel 2 */

/******************  Bit definition for ADC_PCDTO3 register  ******************/
#define ADC_PCDTO3_PCDTO3_Pos               (0U)
#define ADC_PCDTO3_PCDTO3_Msk               (0xFFFU << ADC_PCDTO3_PCDTO3_Pos)       /*!< 0x00000FFF */
#define ADC_PCDTO3_PCDTO3                   ADC_PCDTO3_PCDTO3_Msk                   /*!< Data offset for Preempted channel 3 */

/******************  Bit definition for ADC_PCDTO4 register  ******************/
#define ADC_PCDTO4_PCDTO4_Pos               (0U)
#define ADC_PCDTO4_PCDTO4_Msk               (0xFFFU << ADC_PCDTO4_PCDTO4_Pos)       /*!< 0x00000FFF */
#define ADC_PCDTO4_PCDTO4                   ADC_PCDTO4_PCDTO4_Msk                   /*!< Data offset for Preempted channel 4 */

/*******************  Bit definition for ADC_VMHB register  ********************/
#define ADC_VMHB_VMHB_Pos                   (0U)
#define ADC_VMHB_VMHB_Msk                   (0xFFFFU << ADC_VMHB_VMHB_Pos)          /*!< 0x0000FFFF */
#define ADC_VMHB_VMHB                       ADC_VMHB_VMHB_Msk                       /*!< Voltage monitoring high boundary */

/*******************  Bit definition for ADC_VMLB register  ********************/
#define ADC_VMLB_VMLB_Pos                   (0U)
#define ADC_VMLB_VMLB_Msk                   (0xFFFFU << ADC_VMLB_VMLB_Pos)          /*!< 0x0000FFFF */
#define ADC_VMLB_VMLB                       ADC_VMLB_VMLB_Msk                       /*!< Voltage monitoring low boundary */

/*******************  Bit definition for ADC_OSQ1 register  *******************/
/*!< OSN13 configuration */
#define ADC_OSQ1_OSN13_Pos                  (0U)
#define ADC_OSQ1_OSN13_Msk                  (0x1FU << ADC_OSQ1_OSN13_Pos)           /*!< 0x0000001F */
#define ADC_OSQ1_OSN13                      ADC_OSQ1_OSN13_Msk                      /*!< OSN13[4:0] bits (Number of 13th conversion in ordinary sequence) */
#define ADC_OSQ1_OSN13_0                    (0x01U << ADC_OSQ1_OSN13_Pos)           /*!< 0x00000001 */
#define ADC_OSQ1_OSN13_1                    (0x02U << ADC_OSQ1_OSN13_Pos)           /*!< 0x00000002 */
#define ADC_OSQ1_OSN13_2                    (0x04U << ADC_OSQ1_OSN13_Pos)           /*!< 0x00000004 */
#define ADC_OSQ1_OSN13_3                    (0x08U << ADC_OSQ1_OSN13_Pos)           /*!< 0x00000008 */
#define ADC_OSQ1_OSN13_4                    (0x10U << ADC_OSQ1_OSN13_Pos)           /*!< 0x00000010 */

/*!< OSN14 configuration */
#define ADC_OSQ1_OSN14_Pos                  (5U)
#define ADC_OSQ1_OSN14_Msk                  (0x1FU << ADC_OSQ1_OSN14_Pos)           /*!< 0x000003E0 */
#define ADC_OSQ1_OSN14                      ADC_OSQ1_OSN14_Msk                      /*!< OSN14[4:0] bits (Number of 14th conversion in ordinary sequence) */
#define ADC_OSQ1_OSN14_0                    (0x01U << ADC_OSQ1_OSN14_Pos)           /*!< 0x00000020 */
#define ADC_OSQ1_OSN14_1                    (0x02U << ADC_OSQ1_OSN14_Pos)           /*!< 0x00000040 */
#define ADC_OSQ1_OSN14_2                    (0x04U << ADC_OSQ1_OSN14_Pos)           /*!< 0x00000080 */
#define ADC_OSQ1_OSN14_3                    (0x08U << ADC_OSQ1_OSN14_Pos)           /*!< 0x00000100 */
#define ADC_OSQ1_OSN14_4                    (0x10U << ADC_OSQ1_OSN14_Pos)           /*!< 0x00000200 */

/*!< OSN15 configuration */
#define ADC_OSQ1_OSN15_Pos                  (10U)
#define ADC_OSQ1_OSN15_Msk                  (0x1FU << ADC_OSQ1_OSN15_Pos)           /*!< 0x00007C00 */
#define ADC_OSQ1_OSN15                      ADC_OSQ1_OSN15_Msk                      /*!< OSN15[4:0] bits (Number of 15th conversion in ordinary sequence) */
#define ADC_OSQ1_OSN15_0                    (0x01U << ADC_OSQ1_OSN15_Pos)           /*!< 0x00000400 */
#define ADC_OSQ1_OSN15_1                    (0x02U << ADC_OSQ1_OSN15_Pos)           /*!< 0x00000800 */
#define ADC_OSQ1_OSN15_2                    (0x04U << ADC_OSQ1_OSN15_Pos)           /*!< 0x00001000 */
#define ADC_OSQ1_OSN15_3                    (0x08U << ADC_OSQ1_OSN15_Pos)           /*!< 0x00002000 */
#define ADC_OSQ1_OSN15_4                    (0x10U << ADC_OSQ1_OSN15_Pos)           /*!< 0x00004000 */

/*!< OSN16 configuration */
#define ADC_OSQ1_OSN16_Pos                  (15U)
#define ADC_OSQ1_OSN16_Msk                  (0x1FU << ADC_OSQ1_OSN16_Pos)           /*!< 0x000F8000 */
#define ADC_OSQ1_OSN16                      ADC_OSQ1_OSN16_Msk                      /*!< OSN16[4:0] bits (Number of 16th conversion in ordinary sequence) */
#define ADC_OSQ1_OSN16_0                    (0x01U << ADC_OSQ1_OSN16_Pos)           /*!< 0x00008000 */
#define ADC_OSQ1_OSN16_1                    (0x02U << ADC_OSQ1_OSN16_Pos)           /*!< 0x00010000 */
#define ADC_OSQ1_OSN16_2                    (0x04U << ADC_OSQ1_OSN16_Pos)           /*!< 0x00020000 */
#define ADC_OSQ1_OSN16_3                    (0x08U << ADC_OSQ1_OSN16_Pos)           /*!< 0x00040000 */
#define ADC_OSQ1_OSN16_4                    (0x10U << ADC_OSQ1_OSN16_Pos)           /*!< 0x00080000 */

