ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437vx.h
/*!< ADCDIV configuration */
#define ADC_CCTRL_ADCDIV_Pos                (16U)
#define ADC_CCTRL_ADCDIV_Msk                (0xFU << ADC_CCTRL_ADCDIV_Pos)          /*!< 0x000F0000 */
#define ADC_CCTRL_ADCDIV                    ADC_CCTRL_ADCDIV_Msk                    /*!< ADCDIV[3:0] bits (ADC division) */
#define ADC_CCTRL_ADCDIV_0                  (0x1U << ADC_CCTRL_ADCDIV_Pos)          /*!< 0x00010000 */
#define ADC_CCTRL_ADCDIV_1                  (0x2U << ADC_CCTRL_ADCDIV_Pos)          /*!< 0x00020000 */
#define ADC_CCTRL_ADCDIV_2                  (0x4U << ADC_CCTRL_ADCDIV_Pos)          /*!< 0x00040000 */
#define ADC_CCTRL_ADCDIV_3                  (0x8U << ADC_CCTRL_ADCDIV_Pos)          /*!< 0x00080000 */

#define ADC_CCTRL_ADCDIV_DIV2               0x00000000U                             /*!< HCLK/2 */
#define ADC_CCTRL_ADCDIV_DIV3               0x00010000U                             /*!< HCLK/3 */
#define ADC_CCTRL_ADCDIV_DIV4               0x00020000U                             /*!< HCLK/4 */
#define ADC_CCTRL_ADCDIV_DIV5               0x00030000U                             /*!< HCLK/5 */
#define ADC_CCTRL_ADCDIV_DIV6               0x00040000U                             /*!< HCLK/6 */
#define ADC_CCTRL_ADCDIV_DIV7               0x00050000U                             /*!< HCLK/7 */
#define ADC_CCTRL_ADCDIV_DIV8               0x00060000U                             /*!< HCLK/8 */
#define ADC_CCTRL_ADCDIV_DIV9               0x00070000U                             /*!< HCLK/9 */
#define ADC_CCTRL_ADCDIV_DIV10              0x00080000U                             /*!< HCLK/10 */
#define ADC_CCTRL_ADCDIV_DIV11              0x00090000U                             /*!< HCLK/11 */
#define ADC_CCTRL_ADCDIV_DIV12              0x000A0000U                             /*!< HCLK/12 */
#define ADC_CCTRL_ADCDIV_DIV13              0x000B0000U                             /*!< HCLK/13 */
#define ADC_CCTRL_ADCDIV_DIV14              0x000C0000U                             /*!< HCLK/14 */
#define ADC_CCTRL_ADCDIV_DIV15              0x000D0000U                             /*!< HCLK/15 */
#define ADC_CCTRL_ADCDIV_DIV16              0x000E0000U                             /*!< HCLK/16 */
#define ADC_CCTRL_ADCDIV_DIV17              0x000F0000U                             /*!< HCLK/17 */

#define ADC_CCTRL_VBATEN_Pos                (22U)
#define ADC_CCTRL_VBATEN_Msk                (0x1U << ADC_CCTRL_VBATEN_Pos)          /*!< 0x00400000 */
#define ADC_CCTRL_VBATEN                    ADC_CCTRL_VBATEN_Msk                    /*!< VBATEN bits VBAT enable */
#define ADC_CCTRL_ITSRVEN_Pos               (23U)
#define ADC_CCTRL_ITSRVEN_Msk               (0x1U << ADC_CCTRL_VBATEN_Pos)          /*!< 0x00800000 */
#define ADC_CCTRL_ITSRVEN                   ADC_CCTRL_VBATEN_Msk                    /*!< ITSRVEN bits Internal temperature sensor and VINTRV enable */

/******************  Bit definition for ADC_CODT register  *******************/
#define ADC_CODT_CODTL_Pos                  (0U)
#define ADC_CODT_CODTL_Msk                  (0xFFFFU << ADC_CODT_CODTL_Pos)         /*!< 0x0000FFFF */
#define ADC_CODT_CODTL                      ADC_CODT_CODTL_Msk                      /*!< conversions low halfword data for master slave mode */

#define ADC_CODT_CODTH_Pos                  (16U)
#define ADC_CODT_CODTH_Msk                  (0xFFFFU << ADC_CODT_CODTH_Pos)         /*!< 0x0000FFFF */
#define ADC_CODT_CODTH                      ADC_CODT_CODTH_Msk                      /*!< conversions high halfword data for master slave mode */

/******************************************************************************/
/*                                                                            */
/*                       Controller Area Network (CAN)                        */
/*                                                                            */
/******************************************************************************/

/*!< CAN control and status registers */
/******************  Bit definition for CAN_MCTRL register  *******************/
#define CAN_MCTRL_FZEN_Pos                  (0U)
#define CAN_MCTRL_FZEN_Msk                  (0x1U << CAN_MCTRL_FZEN_Pos)            /*!< 0x00000001 */
#define CAN_MCTRL_FZEN                      CAN_MCTRL_FZEN_Msk                      /*!< Freeze mode enable */
#define CAN_MCTRL_DZEN_Pos                  (1U)
#define CAN_MCTRL_DZEN_Msk                  (0x1U << CAN_MCTRL_DZEN_Pos)            /*!< 0x00000002 */
#define CAN_MCTRL_DZEN                      CAN_MCTRL_DZEN_Msk                      /*!< Doze mode enable */
#define CAN_MCTRL_MMSSR_Pos                 (2U)
#define CAN_MCTRL_MMSSR_Msk                 (0x1U << CAN_MCTRL_MMSSR_Pos)           /*!< 0x00000004 */
#define CAN_MCTRL_MMSSR                     CAN_MCTRL_MMSSR_Msk                     /*!< Multiple message transmit sequence rule */
#define CAN_MCTRL_MDRSEL_Pos                (3U)
#define CAN_MCTRL_MDRSEL_Msk                (0x1U << CAN_MCTRL_MDRSEL_Pos)          /*!< 0x00000008 */
#define CAN_MCTRL_MDRSEL                    CAN_MCTRL_MDRSEL_Msk                    /*!< Message discard rule select when overflow */
#define CAN_MCTRL_PRSFEN_Pos                (4U)
#define CAN_MCTRL_PRSFEN_Msk                (0x1U << CAN_MCTRL_PRSFEN_Pos)          /*!< 0x00000010 */
#define CAN_MCTRL_PRSFEN                    CAN_MCTRL_PRSFEN_Msk                    /*!< Prohibit retransmission enable when sending fails enable */
#define CAN_MCTRL_AEDEN_Pos                 (5U)
#define CAN_MCTRL_AEDEN_Msk                 (0x1U << CAN_MCTRL_AEDEN_Pos)           /*!< 0x00000020 */
#define CAN_MCTRL_AEDEN                     CAN_MCTRL_AEDEN_Msk                     /*!< Automatic exit doze mode enable */
#define CAN_MCTRL_AEBOEN_Pos                (6U)
#define CAN_MCTRL_AEBOEN_Msk                (0x1U << CAN_MCTRL_AEBOEN_Pos)          /*!< 0x00000040 */
#define CAN_MCTRL_AEBOEN                    CAN_MCTRL_AEBOEN_Msk                    /*!< Automatic exit bus-off enable */
#define CAN_MCTRL_TTCEN_Pos                 (7U)
#define CAN_MCTRL_TTCEN_Msk                 (0x1U << CAN_MCTRL_TTCEN_Pos)           /*!< 0x00000080 */
#define CAN_MCTRL_TTCEN                     CAN_MCTRL_TTCEN_Msk                     /*!< Time triggered communication mode enable */
#define CAN_MCTRL_SPRST_Pos                 (15U)
#define CAN_MCTRL_SPRST_Msk                 (0x1U << CAN_MCTRL_SPRST_Pos)           /*!< 0x00008000 */
#define CAN_MCTRL_SPRST                     CAN_MCTRL_SPRST_Msk                     /*!< Software partial reset */
#define CAN_MCTRL_PTD_Pos                   (16U)
#define CAN_MCTRL_PTD_Msk                   (0x1U << CAN_MCTRL_PTD_Pos)             /*!< 0x00010000 */
#define CAN_MCTRL_PTD                       CAN_MCTRL_PTD_Msk                       /*!< Prohibit trans when debug */

