ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437vx.h
/*****************  Bit definition for QSPI_FIFOSTS register  *****************/
#define QSPI_FIFOSTS_TXFIFORDY_Pos          (0U)
#define QSPI_FIFOSTS_TXFIFORDY_Msk          (0x1U << QSPI_FIFOSTS_TXFIFORDY_Pos)    /*!< 0x00000001 */
#define QSPI_FIFOSTS_TXFIFORDY              QSPI_FIFOSTS_TXFIFORDY_Msk              /*!< TX FIFO ready status */
#define QSPI_FIFOSTS_RXFIFORDY_Pos          (1U)
#define QSPI_FIFOSTS_RXFIFORDY_Msk          (0x1U << QSPI_FIFOSTS_RXFIFORDY_Pos)    /*!< 0x00000002 */
#define QSPI_FIFOSTS_RXFIFORDY              QSPI_FIFOSTS_RXFIFORDY_Msk              /*!< RX FIFO ready status */

/******************  Bit definition for QSPI_CTRL2 register  ******************/
#define QSPI_CTRL2_DMAEN_Pos                (0U)
#define QSPI_CTRL2_DMAEN_Msk                (0x1U << QSPI_CTRL2_DMAEN_Pos)          /*!< 0x00000001 */
#define QSPI_CTRL2_DMAEN                    QSPI_CTRL2_DMAEN_Msk                    /*!< DMA enable */
#define QSPI_CTRL2_CMDIE_Pos                (1U)
#define QSPI_CTRL2_CMDIE_Msk                (0x1U << QSPI_CTRL2_CMDIE_Pos)          /*!< 0x00000002 */
#define QSPI_CTRL2_CMDIE                    QSPI_CTRL2_CMDIE_Msk                    /*!< Command complete Interrupt enable */

/*!< TXFIFO_THOD congiguration */
#define QSPI_CTRL2_TXFIFO_THOD_Pos          (8U)
#define QSPI_CTRL2_TXFIFO_THOD_Msk          (0x3U << QSPI_CTRL2_TXFIFO_THOD_Pos)    /*!< 0x00000300 */
#define QSPI_CTRL2_TXFIFO_THOD              QSPI_CTRL2_TXFIFO_THOD_Msk              /*!< TXFIFO_THOD[1:0] bits (Program the level value to trigger TX FIFO threshold IRQ) */
#define QSPI_CTRL2_TXFIFO_THOD_0            (0x1U << QSPI_CTRL2_TXFIFO_THOD_Pos)    /*!< 0x00000100 */
#define QSPI_CTRL2_TXFIFO_THOD_1            (0x2U << QSPI_CTRL2_TXFIFO_THOD_Pos)    /*!< 0x00000200 */

#define QSPI_CTRL2_TXFIFO_THOD_8WORD        0x00000000U                             /*!< 8 WORD */
#define QSPI_CTRL2_TXFIFO_THOD_16WORD       0x00000100U                             /*!< 16 WORD */
#define QSPI_CTRL2_TXFIFO_THOD_24WORD       0x00000200U                             /*!< 24 WORD */

/*!< RXFIFO_THOD congiguration */
#define QSPI_CTRL2_RXFIFO_THOD_Pos          (12U)
#define QSPI_CTRL2_RXFIFO_THOD_Msk          (0x3U << QSPI_CTRL2_RXFIFO_THOD_Pos)    /*!< 0x00003000 */
#define QSPI_CTRL2_RXFIFO_THOD              QSPI_CTRL2_RXFIFO_THOD_Msk              /*!< RXFIFO_THOD[1:0] bits (Program the level value to trigger RX FIFO threshold IRQ) */
#define QSPI_CTRL2_RXFIFO_THOD_0            (0x1U << QSPI_CTRL2_RXFIFO_THOD_Pos)    /*!< 0x00001000 */
#define QSPI_CTRL2_RXFIFO_THOD_1            (0x2U << QSPI_CTRL2_RXFIFO_THOD_Pos)    /*!< 0x00002000 */

#define QSPI_CTRL2_RXFIFO_THOD_8WORD        0x00000000U                             /*!< 8 WORD */
#define QSPI_CTRL2_RXFIFO_THOD_16WORD       0x00001000U                             /*!< 16 WORD */
#define QSPI_CTRL2_RXFIFO_THOD_24WORD       0x00002000U                             /*!< 24 WORD */

/*****************  Bit definition for QSPI_CMDSTS register  ******************/
#define QSPI_CMDSTS_CMDSTS_Pos              (0U)
#define QSPI_CMDSTS_CMDSTS_Msk              (0x1U << QSPI_CMDSTS_CMDSTS_Pos)        /*!< 0x00000001 */
#define QSPI_CMDSTS_CMDSTS                  QSPI_CMDSTS_CMDSTS_Msk                  /*!< Command complete status */

/******************  Bit definition for QSPI_RSTS register  *******************/
#define QSPI_RSTS_SPISTS_Pos                (0U)
#define QSPI_RSTS_SPISTS_Msk                (0xFFU << QSPI_RSTS_SPISTS_Pos)         /*!< 0x000000FF */
#define QSPI_RSTS_SPISTS                    QSPI_RSTS_SPISTS_Msk                    /*!< SPI read status */

/******************  Bit definition for QSPI_FSIZE register  ******************/
#define QSPI_FSIZE_SPIFSIZE_Pos             (0U)                                    /*!< 0xFFFFFFFF */
#define QSPI_FSIZE_SPIFSIZE_Msk             (0xFFFFFFFFU << QSPI_FSIZE_SPIFSIZE_Pos)
#define QSPI_FSIZE_SPIFSIZE                 QSPI_FSIZE_SPIFSIZE_Msk                 /*!< SPI flash size */

/***************  Bit definition for QSPI_XIP_CMD_W0 register  ****************/
/*!< XIPR_DUM2 congiguration */
#define QSPI_XIP_CMD_W0_XIPR_DUM2_Pos       (0U)
#define QSPI_XIP_CMD_W0_XIPR_DUM2_Msk       (0xFFU << QSPI_XIP_CMD_W0_XIPR_DUM2_Pos) /*!< 0x000000FF */
#define QSPI_XIP_CMD_W0_XIPR_DUM2           QSPI_XIP_CMD_W0_XIPR_DUM2_Msk            /*!< XIPR_DUM2[7:0] bits (XIP read second dummy cycle) */
#define QSPI_XIP_CMD_W0_XIPR_DUM2_0         (0x01U << QSPI_XIP_CMD_W0_XIPR_DUM2_Pos) /*!< 0x00000001 */
#define QSPI_XIP_CMD_W0_XIPR_DUM2_1         (0x02U << QSPI_XIP_CMD_W0_XIPR_DUM2_Pos) /*!< 0x00000002 */
#define QSPI_XIP_CMD_W0_XIPR_DUM2_2         (0x04U << QSPI_XIP_CMD_W0_XIPR_DUM2_Pos) /*!< 0x00000004 */
#define QSPI_XIP_CMD_W0_XIPR_DUM2_3         (0x08U << QSPI_XIP_CMD_W0_XIPR_DUM2_Pos) /*!< 0x00000008 */
#define QSPI_XIP_CMD_W0_XIPR_DUM2_4         (0x10U << QSPI_XIP_CMD_W0_XIPR_DUM2_Pos) /*!< 0x00000010 */
#define QSPI_XIP_CMD_W0_XIPR_DUM2_5         (0x20U << QSPI_XIP_CMD_W0_XIPR_DUM2_Pos) /*!< 0x00000020 */
#define QSPI_XIP_CMD_W0_XIPR_DUM2_6         (0x40U << QSPI_XIP_CMD_W0_XIPR_DUM2_Pos) /*!< 0x00000040 */
#define QSPI_XIP_CMD_W0_XIPR_DUM2_7         (0x80U << QSPI_XIP_CMD_W0_XIPR_DUM2_Pos) /*!< 0x00000080 */

/*!< XIPR_OPMODE congiguration */
#define QSPI_XIP_CMD_W0_XIPR_OPMODE_Pos     (8U)                                      /*!< 0x00000700 */
#define QSPI_XIP_CMD_W0_XIPR_OPMODE_Msk     (0x7U << QSPI_XIP_CMD_W0_XIPR_OPMODE_Pos)
#define QSPI_XIP_CMD_W0_XIPR_OPMODE         QSPI_XIP_CMD_W0_XIPR_OPMODE_Msk           /*!< XIPR_OPMODE[2:0] bits (XIP read operation mode) */
#define QSPI_XIP_CMD_W0_XIPR_OPMODE_0       (0x1U << QSPI_XIP_CMD_W0_XIPR_OPMODE_Pos) /*!< 0x00000100 */
#define QSPI_XIP_CMD_W0_XIPR_OPMODE_1       (0x2U << QSPI_XIP_CMD_W0_XIPR_OPMODE_Pos) /*!< 0x00000200 */
#define QSPI_XIP_CMD_W0_XIPR_OPMODE_2       (0x4U << QSPI_XIP_CMD_W0_XIPR_OPMODE_Pos) /*!< 0x00000400 */

#define QSPI_XIP_CMD_W0_XIPR_OPMODE_SERIAL  0x00000000U                             /*!< Serial mode (1-1-1) */
#define QSPI_XIP_CMD_W0_XIPR_OPMODE_DUAL    0x00000100U                             /*!< Dual-wire mode (1-1-2) */
#define QSPI_XIP_CMD_W0_XIPR_OPMODE_QUAD    0x00000200U                             /*!< Quad mode (1-1-4) */
#define QSPI_XIP_CMD_W0_XIPR_OPMODE_DUALIO  0x00000300U                             /*!< Dual-wire I/O mode (1-2-2) */
#define QSPI_XIP_CMD_W0_XIPR_OPMODE_QUADIO  0x00000400U                             /*!< Quad I/O mode (1-4-4) */
#define QSPI_XIP_CMD_W0_XIPR_OPMODE_DPI     0x00000500U                             /*!< DPI mode (2-2-2) */
#define QSPI_XIP_CMD_W0_XIPR_OPMODE_QPI     0x00000600U                             /*!< QPI mode (4-4-4) */

#define QSPI_XIP_CMD_W0_XIPR_ADRLEN_Pos     (11U)                                   /*!< 0x00000800 */
#define QSPI_XIP_CMD_W0_XIPR_ADRLEN_Msk     (0x1U << QSPI_XIP_CMD_W0_XIPR_ADRLEN_Pos)
#define QSPI_XIP_CMD_W0_XIPR_ADRLEN         QSPI_XIP_CMD_W0_XIPR_ADRLEN_Msk         /*!< XIP read address length */
#define QSPI_XIP_CMD_W0_XIPR_INSC_Pos       (12U)                                   /*!< 0x000FF000 */
#define QSPI_XIP_CMD_W0_XIPR_INSC_Msk       (0xFFU << QSPI_XIP_CMD_W0_XIPR_INSC_Pos)
#define QSPI_XIP_CMD_W0_XIPR_INSC           QSPI_XIP_CMD_W0_XIPR_INSC_Msk           /*!< XIP read instruction code */

/***************  Bit definition for QSPI_XIP_CMD_W1 register  ****************/
/*!< XIPW_DUM2 congiguration */
#define QSPI_XIP_CMD_W1_XIPW_DUM2_Pos       (0U)
#define QSPI_XIP_CMD_W1_XIPW_DUM2_Msk       (0xFFU << QSPI_XIP_CMD_W1_XIPW_DUM2_Pos) /*!< 0x000000FF */
#define QSPI_XIP_CMD_W1_XIPW_DUM2           QSPI_XIP_CMD_W1_XIPW_DUM2_Msk            /*!< XIPW_DUM2[7:0] bits (XIP write second dummy cycle) */
#define QSPI_XIP_CMD_W1_XIPW_DUM2_0         (0x01U << QSPI_XIP_CMD_W1_XIPW_DUM2_Pos) /*!< 0x00000001 */
#define QSPI_XIP_CMD_W1_XIPW_DUM2_1         (0x02U << QSPI_XIP_CMD_W1_XIPW_DUM2_Pos) /*!< 0x00000002 */
#define QSPI_XIP_CMD_W1_XIPW_DUM2_2         (0x04U << QSPI_XIP_CMD_W1_XIPW_DUM2_Pos) /*!< 0x00000004 */
#define QSPI_XIP_CMD_W1_XIPW_DUM2_3         (0x08U << QSPI_XIP_CMD_W1_XIPW_DUM2_Pos) /*!< 0x00000008 */
#define QSPI_XIP_CMD_W1_XIPW_DUM2_4         (0x10U << QSPI_XIP_CMD_W1_XIPW_DUM2_Pos) /*!< 0x00000010 */
#define QSPI_XIP_CMD_W1_XIPW_DUM2_5         (0x20U << QSPI_XIP_CMD_W1_XIPW_DUM2_Pos) /*!< 0x00000020 */
#define QSPI_XIP_CMD_W1_XIPW_DUM2_6         (0x40U << QSPI_XIP_CMD_W1_XIPW_DUM2_Pos) /*!< 0x00000040 */
#define QSPI_XIP_CMD_W1_XIPW_DUM2_7         (0x80U << QSPI_XIP_CMD_W1_XIPW_DUM2_Pos) /*!< 0x00000080 */

/*!< XIPW_OPMODE congiguration */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_Pos     (8U)                                      /*!< 0x00000700 */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_Msk     (0x7U << QSPI_XIP_CMD_W1_XIPW_OPMODE_Pos)
#define QSPI_XIP_CMD_W1_XIPW_OPMODE         QSPI_XIP_CMD_W1_XIPW_OPMODE_Msk           /*!< XIPW_OPMODE[2:0] bits (XIP write operation mode) */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_0       (0x1U << QSPI_XIP_CMD_W1_XIPW_OPMODE_Pos) /*!< 0x00000100 */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_1       (0x2U << QSPI_XIP_CMD_W1_XIPW_OPMODE_Pos) /*!< 0x00000200 */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_2       (0x4U << QSPI_XIP_CMD_W1_XIPW_OPMODE_Pos) /*!< 0x00000400 */

