ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437vx.h
/*******************  Bit definition for SDIO_ARG register  *******************/
#define SDIO_ARG_ARGU_Pos                   (0U)
#define SDIO_ARG_ARGU_Msk                   (0xFFFFFFFFU << SDIO_ARG_ARGU_Pos)      /*!< 0xFFFFFFFF */
#define SDIO_ARG_ARGU                       SDIO_ARG_ARGU_Msk                       /*!< Command argument */

/*******************  Bit definition for SDIO_CMD register  *******************/
#define SDIO_CMD_CMDIDX_Pos                 (0U)
#define SDIO_CMD_CMDIDX_Msk                 (0x3FU << SDIO_CMD_CMDIDX_Pos)          /*!< 0x0000003F */
#define SDIO_CMD_CMDIDX                     SDIO_CMD_CMDIDX_Msk                     /*!< Command index */

/*!< RSPWT congiguration */
#define SDIO_CMD_RSPWT_Pos                  (6U)
#define SDIO_CMD_RSPWT_Msk                  (0x3U << SDIO_CMD_RSPWT_Pos)            /*!< 0x000000C0 */
#define SDIO_CMD_RSPWT                      SDIO_CMD_RSPWT_Msk                      /*!< RSPWT[1:0] bits (Wait for response bits) */
#define SDIO_CMD_RSPWT_0                    (0x1U << SDIO_CMD_RSPWT_Pos)            /*!< 0x00000040 */
#define SDIO_CMD_RSPWT_1                    (0x2U << SDIO_CMD_RSPWT_Pos)            /*!< 0x00000080 */

#define SDIO_CMD_INTWT_Pos                  (8U)
#define SDIO_CMD_INTWT_Msk                  (0x1U << SDIO_CMD_INTWT_Pos)            /*!< 0x00000100 */
#define SDIO_CMD_INTWT                      SDIO_CMD_INTWT_Msk                      /*!< CCSM waits for interrupt request */
#define SDIO_CMD_PNDWT_Pos                  (9U)
#define SDIO_CMD_PNDWT_Msk                  (0x1U << SDIO_CMD_PNDWT_Pos)            /*!< 0x00000200 */
#define SDIO_CMD_PNDWT                      SDIO_CMD_PNDWT_Msk                      /*!< CCSM Waits for ends of data transfer (CmdPend internal signal) */
#define SDIO_CMD_CCSMEN_Pos                 (10U)
#define SDIO_CMD_CCSMEN_Msk                 (0x1U << SDIO_CMD_CCSMEN_Pos)           /*!< 0x00000400 */
#define SDIO_CMD_CCSMEN                     SDIO_CMD_CCSMEN_Msk                     /*!< Command channel state machine (CCSM) enable bit */
#define SDIO_CMD_IOSUSP_Pos                 (11U)
#define SDIO_CMD_IOSUSP_Msk                 (0x1U << SDIO_CMD_IOSUSP_Pos)           /*!< 0x00000800 */
#define SDIO_CMD_IOSUSP                     SDIO_CMD_IOSUSP_Msk                     /*!< SD I/O suspend command */

/*****************  Bit definition for SDIO_RSPCMD register  ******************/
#define SDIO_RSPCMD_RSPCMD_Pos              (0U)
#define SDIO_RSPCMD_RSPCMD_Msk              (0x3FU << SDIO_RSPCMD_RSPCMD_Pos)       /*!< 0x0000003F */
#define SDIO_RSPCMD_RSPCMD                  SDIO_RSPCMD_RSPCMD_Msk                  /*!< Response command index */

/******************  Bit definition for SDIO_RSP1 register  *******************/
#define SDIO_RSP1_CARDSTS1_Pos              (0U)
#define SDIO_RSP1_CARDSTS1_Msk              (0xFFFFFFFFU << SDIO_RSP1_CARDSTS1_Pos) /*!< 0xFFFFFFFF */
#define SDIO_RSP1_CARDSTS1                  SDIO_RSP1_CARDSTS1_Msk                  /*!< Card status */

/******************  Bit definition for SDIO_RSP2 register  *******************/
#define SDIO_RSP2_CARDSTS2_Pos              (0U)
#define SDIO_RSP2_CARDSTS2_Msk              (0xFFFFFFFFU << SDIO_RSP2_CARDSTS2_Pos) /*!< 0xFFFFFFFF */
#define SDIO_RSP2_CARDSTS2                  SDIO_RSP2_CARDSTS2_Msk                  /*!< Card status */

/******************  Bit definition for SDIO_RSP3 register  *******************/
#define SDIO_RSP3_CARDSTS3_Pos              (0U)
#define SDIO_RSP3_CARDSTS3_Msk              (0xFFFFFFFFU << SDIO_RSP3_CARDSTS3_Pos) /*!< 0xFFFFFFFF */
#define SDIO_RSP3_CARDSTS3                  SDIO_RSP3_CARDSTS3_Msk                  /*!< Card status */

/******************  Bit definition for SDIO_RSP4 register  *******************/
#define SDIO_RSP4_CARDSTS4_Pos              (0U)
#define SDIO_RSP4_CARDSTS4_Msk              (0xFFFFFFFFU << SDIO_RSP4_CARDSTS4_Pos) /*!< 0xFFFFFFFF */
#define SDIO_RSP4_CARDSTS4                  SDIO_RSP4_CARDSTS4_Msk                  /*!< Card status */

/******************  Bit definition for SDIO_DTTMR register  ******************/
#define SDIO_DTTMR_TIMEOUT_Pos              (0U)
#define SDIO_DTTMR_TIMEOUT_Msk              (0xFFFFFFFFU << SDIO_DTTMR_TIMEOUT_Pos) /*!< 0xFFFFFFFF */
#define SDIO_DTTMR_TIMEOUT                  SDIO_DTTMR_TIMEOUT_Msk                  /*!< Data timeout period */

/******************  Bit definition for SDIO_DTLEN register  ******************/
#define SDIO_DTLEN_DTLEN_Pos                (0U)
#define SDIO_DTLEN_DTLEN_Msk                (0x1FFFFFFU << SDIO_DTLEN_DTLEN_Pos)    /*!< 0x01FFFFFF */
#define SDIO_DTLEN_DTLEN                    SDIO_DTLEN_DTLEN_Msk                    /*!< Data length value */

/*****************  Bit definition for SDIO_DTCTRL register  ******************/
#define SDIO_DTCTRL_TFREN_Pos               (0U)
#define SDIO_DTCTRL_TFREN_Msk               (0x1U << SDIO_DTCTRL_TFREN_Pos)         /*!< 0x00000001 */
#define SDIO_DTCTRL_TFREN                   SDIO_DTCTRL_TFREN_Msk                   /*!< Data transfer enabled bit */
#define SDIO_DTCTRL_TFRDIR_Pos              (1U)
#define SDIO_DTCTRL_TFRDIR_Msk              (0x1U << SDIO_DTCTRL_TFRDIR_Pos)        /*!< 0x00000002 */
#define SDIO_DTCTRL_TFRDIR                  SDIO_DTCTRL_TFRDIR_Msk                  /*!< Data transfer direction selection */
#define SDIO_DTCTRL_TFRMODE_Pos             (2U)
#define SDIO_DTCTRL_TFRMODE_Msk             (0x1U << SDIO_DTCTRL_TFRMODE_Pos)       /*!< 0x00000004 */
#define SDIO_DTCTRL_TFRMODE                 SDIO_DTCTRL_TFRMODE_Msk                 /*!< Data transfer mode selection */
#define SDIO_DTCTRL_DMAEN_Pos               (3U)
#define SDIO_DTCTRL_DMAEN_Msk               (0x1U << SDIO_DTCTRL_DMAEN_Pos)         /*!< 0x00000008 */
#define SDIO_DTCTRL_DMAEN                   SDIO_DTCTRL_DMAEN_Msk                   /*!< DMA enable bit */

/*!< BLKSIZE congiguration */
#define SDIO_DTCTRL_BLKSIZE_Pos             (4U)
#define SDIO_DTCTRL_BLKSIZE_Msk             (0xFU << SDIO_DTCTRL_BLKSIZE_Pos)       /*!< 0x000000F0 */
#define SDIO_DTCTRL_BLKSIZE                 SDIO_DTCTRL_BLKSIZE_Msk                 /*!< BLKSIZE[3:0] bits (Data block size) */
#define SDIO_DTCTRL_BLKSIZE_0               (0x1U << SDIO_DTCTRL_BLKSIZE_Pos)       /*!< 0x00000010 */
#define SDIO_DTCTRL_BLKSIZE_1               (0x2U << SDIO_DTCTRL_BLKSIZE_Pos)       /*!< 0x00000020 */
#define SDIO_DTCTRL_BLKSIZE_2               (0x4U << SDIO_DTCTRL_BLKSIZE_Pos)       /*!< 0x00000040 */
#define SDIO_DTCTRL_BLKSIZE_3               (0x8U << SDIO_DTCTRL_BLKSIZE_Pos)       /*!< 0x00000080 */

#define SDIO_DTCTRL_RDWTSTART_Pos           (8U)
#define SDIO_DTCTRL_RDWTSTART_Msk           (0x1U << SDIO_DTCTRL_RDWTSTART_Pos)     /*!< 0x00000100 */
#define SDIO_DTCTRL_RDWTSTART               SDIO_DTCTRL_RDWTSTART_Msk               /*!< Read wait start */
#define SDIO_DTCTRL_RDWTSTOP_Pos            (9U)
#define SDIO_DTCTRL_RDWTSTOP_Msk            (0x1U << SDIO_DTCTRL_RDWTSTOP_Pos)      /*!< 0x00000200 */
#define SDIO_DTCTRL_RDWTSTOP                SDIO_DTCTRL_RDWTSTOP_Msk                /*!< Read wait stop */
#define SDIO_DTCTRL_RDWTMODE_Pos            (10U)
#define SDIO_DTCTRL_RDWTMODE_Msk            (0x1U << SDIO_DTCTRL_RDWTMODE_Pos)      /*!< 0x00000400 */
#define SDIO_DTCTRL_RDWTMODE                SDIO_DTCTRL_RDWTMODE_Msk                /*!< Read wait mode */
#define SDIO_DTCTRL_IOEN_Pos                (11U)
#define SDIO_DTCTRL_IOEN_Msk                (0x1U << SDIO_DTCTRL_IOEN_Pos)          /*!< 0x00000800 */
#define SDIO_DTCTRL_IOEN                    SDIO_DTCTRL_IOEN_Msk                    /*!< SD I/O enable functions */

/*****************  Bit definition for SDIO_DTCNTR register  ******************/
#define SDIO_DTCNTR_CNT_Pos                 (0U)
#define SDIO_DTCNTR_CNT_Msk                 (0x1FFFFFFU << SDIO_DTCNTR_CNT_Pos)     /*!< 0x01FFFFFF */
#define SDIO_DTCNTR_CNT                     SDIO_DTCNTR_CNT_Msk                     /*!< Data count value */

/*******************  Bit definition for SDIO_STS register  *******************/
#define SDIO_STS_CMDFAIL_Pos                (0U)
#define SDIO_STS_CMDFAIL_Msk                (0x1U << SDIO_STS_CMDFAIL_Pos)          /*!< 0x00000001 */
#define SDIO_STS_CMDFAIL                    SDIO_STS_CMDFAIL_Msk                    /*!< Command response received (CRC check failed) */
#define SDIO_STS_DTFAIL_Pos                 (1U)
#define SDIO_STS_DTFAIL_Msk                 (0x1U << SDIO_STS_DTFAIL_Pos)           /*!< 0x00000002 */
#define SDIO_STS_DTFAIL                     SDIO_STS_DTFAIL_Msk                     /*!< Data block sent/received (CRC check failed) */
#define SDIO_STS_CMDTIMEOUT_Pos             (2U)
#define SDIO_STS_CMDTIMEOUT_Msk             (0x1U << SDIO_STS_CMDTIMEOUT_Pos)       /*!< 0x00000004 */
#define SDIO_STS_CMDTIMEOUT                 SDIO_STS_CMDTIMEOUT_Msk                 /*!< Command response timeout */
#define SDIO_STS_DTTIMEOUT_Pos              (3U)
#define SDIO_STS_DTTIMEOUT_Msk              (0x1U << SDIO_STS_DTTIMEOUT_Pos)        /*!< 0x00000008 */
#define SDIO_STS_DTTIMEOUT                  SDIO_STS_DTTIMEOUT_Msk                  /*!< Data timeout */
#define SDIO_STS_TXERRU_Pos                 (4U)
#define SDIO_STS_TXERRU_Msk                 (0x1U << SDIO_STS_TXERRU_Pos)           /*!< 0x00000010 */
#define SDIO_STS_TXERRU                     SDIO_STS_TXERRU_Msk                     /*!< Transmit BUF underrun error */
#define SDIO_STS_RXERRO_Pos                 (5U)
#define SDIO_STS_RXERRO_Msk                 (0x1U << SDIO_STS_RXERRO_Pos)           /*!< 0x00000020 */
#define SDIO_STS_RXERRO                     SDIO_STS_RXERRO_Msk                     /*!< Received BUF overrun error */
#define SDIO_STS_CMDRSPCMPL_Pos             (6U)
#define SDIO_STS_CMDRSPCMPL_Msk             (0x1U << SDIO_STS_CMDRSPCMPL_Pos)       /*!< 0x00000040 */
#define SDIO_STS_CMDRSPCMPL                 SDIO_STS_CMDRSPCMPL_Msk                 /*!< Command response (CRC check passed) */
#define SDIO_STS_CMDCMPL_Pos                (7U)
#define SDIO_STS_CMDCMPL_Msk                (0x1U << SDIO_STS_CMDCMPL_Pos)          /*!< 0x00000080 */
#define SDIO_STS_CMDCMPL                    SDIO_STS_CMDCMPL_Msk                    /*!< Command sent (no response required) */
#define SDIO_STS_DTCMPL_Pos                 (8U)
#define SDIO_STS_DTCMPL_Msk                 (0x1U << SDIO_STS_DTCMPL_Pos)           /*!< 0x00000100 */
#define SDIO_STS_DTCMPL                     SDIO_STS_DTCMPL_Msk                     /*!< Data end (data counter, SDIO CNT, is zero) */
#define SDIO_STS_SBITERR_Pos                (9U)
#define SDIO_STS_SBITERR_Msk                (0x1U << SDIO_STS_SBITERR_Pos)          /*!< 0x00000200 */
#define SDIO_STS_SBITERR                    SDIO_STS_SBITERR_Msk                    /*!< Start bit not detected on all data signals in wide bus mode */
#define SDIO_STS_DTBLKCMPL_Pos              (10U)
#define SDIO_STS_DTBLKCMPL_Msk              (0x1U << SDIO_STS_DTBLKCMPL_Pos)        /*!< 0x00000400 */
#define SDIO_STS_DTBLKCMPL                  SDIO_STS_DTBLKCMPL_Msk                  /*!< Data block sent/received (CRC check passed) */
#define SDIO_STS_DOCMD_Pos                  (11U)
#define SDIO_STS_DOCMD_Msk                  (0x1U << SDIO_STS_DOCMD_Pos)            /*!< 0x00000800 */
#define SDIO_STS_DOCMD                      SDIO_STS_DOCMD_Msk                      /*!< Command transfer in progress */
#define SDIO_STS_DOTX_Pos                   (12U)
#define SDIO_STS_DOTX_Msk                   (0x1U << SDIO_STS_DOTX_Pos)             /*!< 0x00001000 */
#define SDIO_STS_DOTX                       SDIO_STS_DOTX_Msk                       /*!< Data transmit in progress */
#define SDIO_STS_DORX_Pos                   (13U)
#define SDIO_STS_DORX_Msk                   (0x1U << SDIO_STS_DORX_Pos)             /*!< 0x00002000 */
#define SDIO_STS_DORX                       SDIO_STS_DORX_Msk                       /*!< Data receive in progress */
#define SDIO_STS_TXBUFH_Pos                 (14U)
#define SDIO_STS_TXBUFH_Msk                 (0x1U << SDIO_STS_TXBUFH_Pos)           /*!< 0x00004000 */
#define SDIO_STS_TXBUFH                     SDIO_STS_TXBUFH_Msk                     /*!< Transmit BUF half empty: At least 8 words can be written to the BUF */
#define SDIO_STS_RXBUFH_Pos                 (15U)
#define SDIO_STS_RXBUFH_Msk                 (0x1U << SDIO_STS_RXBUFH_Pos)           /*!< 0x00008000 */
#define SDIO_STS_RXBUFH                     SDIO_STS_RXBUFH_Msk                     /*!< Receive BUF half full: There are at least 8 words in the BUF */
#define SDIO_STS_TXBUFF_Pos                 (16U)
#define SDIO_STS_TXBUFF_Msk                 (0x1U << SDIO_STS_TXBUFF_Pos)           /*!< 0x00010000 */
#define SDIO_STS_TXBUFF                     SDIO_STS_TXBUFF_Msk                     /*!< Transmit BUF full */
#define SDIO_STS_RXBUFF_Pos                 (17U)
#define SDIO_STS_RXBUFF_Msk                 (0x1U << SDIO_STS_RXBUFF_Pos)           /*!< 0x00020000 */
#define SDIO_STS_RXBUFF                     SDIO_STS_RXBUFF_Msk                     /*!< Receive BUF full */
#define SDIO_STS_TXBUFE_Pos                 (18U)
#define SDIO_STS_TXBUFE_Msk                 (0x1U << SDIO_STS_TXBUFE_Pos)           /*!< 0x00040000 */
#define SDIO_STS_TXBUFE                     SDIO_STS_TXBUFE_Msk                     /*!< Transmit BUF empty */
#define SDIO_STS_RXBUFE_Pos                 (19U)
#define SDIO_STS_RXBUFE_Msk                 (0x1U << SDIO_STS_RXBUFE_Pos)           /*!< 0x00080000 */
#define SDIO_STS_RXBUFE                     SDIO_STS_RXBUFE_Msk                     /*!< Receive BUF empty */
#define SDIO_STS_TXBUF_Pos                  (20U)
#define SDIO_STS_TXBUF_Msk                  (0x1U << SDIO_STS_TXBUF_Pos)            /*!< 0x00100000 */
#define SDIO_STS_TXBUF                      SDIO_STS_TXBUF_Msk                      /*!< Data available in transmit BUF */
#define SDIO_STS_RXBUF_Pos                  (21U)
#define SDIO_STS_RXBUF_Msk                  (0x1U << SDIO_STS_RXBUF_Pos)            /*!< 0x00200000 */
#define SDIO_STS_RXBUF                      SDIO_STS_RXBUF_Msk                      /*!< Data available in receive BUF */
#define SDIO_STS_IOIF_Pos                   (22U)
#define SDIO_STS_IOIF_Msk                   (0x1U << SDIO_STS_IOIF_Pos)             /*!< 0x00400000 */
#define SDIO_STS_IOIF                       SDIO_STS_IOIF_Msk                       /*!< SD I/O interrupt received */

/*****************  Bit definition for SDIO_INTCLR register  ******************/
#define SDIO_INTCLR_CMDFAIL_Pos             (0U)
#define SDIO_INTCLR_CMDFAIL_Msk             (0x1U << SDIO_INTCLR_CMDFAIL_Pos)       /*!< 0x00000001 */
#define SDIO_INTCLR_CMDFAIL                 SDIO_INTCLR_CMDFAIL_Msk                 /*!< CMDFAIL flag clear bit */
#define SDIO_INTCLR_DTFAIL_Pos              (1U)
#define SDIO_INTCLR_DTFAIL_Msk              (0x1U << SDIO_INTCLR_DTFAIL_Pos)        /*!< 0x00000002 */
#define SDIO_INTCLR_DTFAIL                  SDIO_INTCLR_DTFAIL_Msk                  /*!< DTFAIL flag clear bit */
#define SDIO_INTCLR_CMDTIMEOUT_Pos          (2U)
#define SDIO_INTCLR_CMDTIMEOUT_Msk          (0x1U << SDIO_INTCLR_CMDTIMEOUT_Pos)    /*!< 0x00000004 */
#define SDIO_INTCLR_CMDTIMEOUT              SDIO_INTCLR_CMDTIMEOUT_Msk              /*!< CMDTIMEOUT flag clear bit */
#define SDIO_INTCLR_DTTIMEOUT_Pos           (3U)
#define SDIO_INTCLR_DTTIMEOUT_Msk           (0x1U << SDIO_INTCLR_DTTIMEOUT_Pos)     /*!< 0x00000008 */
#define SDIO_INTCLR_DTTIMEOUT               SDIO_INTCLR_DTTIMEOUT_Msk               /*!< DTTIMEOUT flag clear bit */
#define SDIO_INTCLR_TXERRU_Pos              (4U)
#define SDIO_INTCLR_TXERRU_Msk              (0x1U << SDIO_INTCLR_TXERRU_Pos)        /*!< 0x00000010 */
#define SDIO_INTCLR_TXERRU                  SDIO_INTCLR_TXERRU_Msk                  /*!< TXERRU flag clear bit */
#define SDIO_INTCLR_RXERRO_Pos              (5U)
#define SDIO_INTCLR_RXERRO_Msk              (0x1U << SDIO_INTCLR_RXERRO_Pos)        /*!< 0x00000020 */
#define SDIO_INTCLR_RXERRO                  SDIO_INTCLR_RXERRO_Msk                  /*!< RXERRO flag clear bit */
#define SDIO_INTCLR_CMDRSPCMPL_Pos          (6U)
#define SDIO_INTCLR_CMDRSPCMPL_Msk          (0x1U << SDIO_INTCLR_CMDRSPCMPL_Pos)    /*!< 0x00000040 */
#define SDIO_INTCLR_CMDRSPCMPL              SDIO_INTCLR_CMDRSPCMPL_Msk              /*!< CMDRSPCMPL flag clear bit */
#define SDIO_INTCLR_CMDCMPL_Pos             (7U)
#define SDIO_INTCLR_CMDCMPL_Msk             (0x1U << SDIO_INTCLR_CMDCMPL_Pos)       /*!< 0x00000080 */
#define SDIO_INTCLR_CMDCMPL                 SDIO_INTCLR_CMDCMPL_Msk                 /*!< CMDCMPL flag clear bit */
#define SDIO_INTCLR_DTCMPL_Pos              (8U)
#define SDIO_INTCLR_DTCMPL_Msk              (0x1U << SDIO_INTCLR_DTCMPL_Pos)        /*!< 0x00000100 */
#define SDIO_INTCLR_DTCMPL                  SDIO_INTCLR_DTCMPL_Msk                  /*!< DTCMPL flag clear bit */
#define SDIO_INTCLR_SBITERR_Pos             (9U)
#define SDIO_INTCLR_SBITERR_Msk             (0x1U << SDIO_INTCLR_SBITERR_Pos)       /*!< 0x00000200 */
#define SDIO_INTCLR_SBITERR                 SDIO_INTCLR_SBITERR_Msk                 /*!< SBITERR flag clear bit */
#define SDIO_INTCLR_DTBLKCMPL_Pos           (10U)
#define SDIO_INTCLR_DTBLKCMPL_Msk           (0x1U << SDIO_INTCLR_DTBLKCMPL_Pos)     /*!< 0x00000400 */
#define SDIO_INTCLR_DTBLKCMPL               SDIO_INTCLR_DTBLKCMPL_Msk               /*!< DTBLKCMPL flag clear bit */
#define SDIO_INTCLR_IOIF_Pos                (22U)
#define SDIO_INTCLR_IOIF_Msk                (0x1U << SDIO_INTCLR_IOIF_Pos)          /*!< 0x00400000 */
#define SDIO_INTCLR_IOIF                    SDIO_INTCLR_IOIF_Msk                    /*!< SD I/O interface flag clear bit */

